Repository: mostafa9011/new_structure_mobile_apps
Catalog: lib/l10n/intl_*.arb
Languages: ar

# connectTimeout
source: The connection to the server timed out. Please check your network connection and try again.
ar: انتهت مهلة الاتصال بالخادم. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.

# sendTimeout
source: Sending the request took too long. Please verify your connection and try again.
ar: استغرق إرسال الطلب وقتًا طويلاً. يرجى التحقق من الشبكة والمحاولة مرة أخرى.

# receiveTimeout
source: Waiting for the server response took too long. Please try again later.
ar: استغرق انتظار استجابة الخادم وقتًا طويلاً. يرجى المحاولة لاحقًا.

# cancelMessage
source: The operation was canceled by the user.
ar: تم إلغاء العملية بواسطة المستخدم.

# badRequest
source: The request was invalid or malformed. Please verify your input and try again.
ar: كانت الطلبية غير صالحة أو مشوّهة. يرجى التحقق من البيانات والمحاولة مرة أخرى.

# unknown
source: An unknown error occurred. Please try again later.
ar: حدث خطأ غير معروف. يرجى المحاولة لاحقًا.

# unauthorized
source: You are not authorized. Please log in and try again.
ar: ليس لديك صلاحية. يرجى تسجيل الدخول والمحاولة مرة أخرى.

# forbidden
source: Access is forbidden. You do not have permission to perform this action.
ar: الوصول ممنوع. لا تملك إذنًا للقيام بهذا الإجراء.

# notFound
source: The requested resource was not found on the server.
ar: المورد المطلوب غير موجود على الخادم.

# serverError
source: The server encountered an internal error. Please try again later.
ar: واجه الخادم خطأ داخلي. يرجى المحاولة لاحقًا.

# unknownError
source: An unexpected error occurred. Please try again later.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.

# timeout
source: The operation timed out. Please check your network and try again.
ar: انتهت مهلة العملية. يرجى التحقق من الشبكة والمحاولة مرة أخرى.

source: Loading...
ar: جار التحميل...

# connectionError
source: An error occurred while connecting to the server. Please try again later.
ar: حدث خطاء في الاتصال بالخادم. يرجى المحاولة لاحقًا.

source: Change Language
ar: تغيير اللغة

source: Change Theme
ar: تغيير الثيم
